import asyncio
import random
from aiogram import Bot, Dispatcher, types

TOKEN = "7954707563:AAGkB_2Drlpst8vdbpPQUpM5Mr3huMzC5lE"

bot = Bot(token=TOKEN)
dp = Dispatcher()

cards = [
    ("Всадник", "Новости"),
    ("Клевер", "Удача"),
    ("Корабль", "Путь"),
    ("Дом", "Стабильность"),
    ("Дерево", "Рост"),
    ("Тучи", "Сомнения"),
    ("Змея", "Хитрость"),
    ("Гроб", "Завершение"),
    ("Букет", "Радость"),
    ("Коса", "Резкое событие"),
    ("Метла", "Конфликт"),
    ("Птицы", "Разговоры"),
    ("Ребёнок", "Начало"),
    ("Лиса", "Осторожность"),
    ("Медведь", "Сила"),
    ("Звёзды", "Надежда"),
    ("Аист", "Перемены"),
    ("Собака", "Дружба"),
    ("Башня", "Одиночество"),
    ("Сад", "Общество"),
    ("Гора", "Препятствия"),
    ("Развилка", "Выбор"),
    ("Крысы", "Потери"),
    ("Сердце", "Любовь"),
    ("Кольцо", "Союз"),
    ("Книга", "Тайна"),
    ("Письмо", "Сообщение"),
    ("Солнце", "Успех"),
    ("Луна", "Интуиция"),
    ("Ключ", "Решение"),
    ("Якорь", "Стабильность"),
]

@dp.message()
async def handler(message: types.Message):
    draw = random.sample(cards, 3)

    await message.answer(
        "🔮 ЛЕНОРМАН РАСКЛАД\n\n"
        f"1️⃣ {draw[0][0]} — {draw[0][1]}\n"
        f"2️⃣ {draw[1][0]} — {draw[1][1]}\n"
        f"3️⃣ {draw[2][0]} — {draw[2][1]}"
    )

async def main():
    await dp.start_polling(bot)

if __name__ == "__main__":
    asyncio.run(main())
